SOAPUtil/bin/msg/CISCUSTA_RQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<CISCUSTA xmlns="http://com.seagullsw.appinterface/LegasuiteCICSEngine">
			<LEG320-COMM-REC xmlns="">
				<LEG320-A-PROC>O</LEG320-A-PROC>
				<LEG320-A-CICS>R</LEG320-A-CICS>
				<LEG320-A-APPL>LEG</LEG320-A-APPL>
				<LEG320-A-PROG>PLAE020</LEG320-A-PROG>
				<LEG320-A-USER>S682153</LEG320-A-USER>
				<LEG320-A-TRAN>XWAA</LEG320-A-TRAN>
				<LEG320-A-TERM>XWAA</LEG320-A-TERM>
				<LEG320-A-DB2-DATE>11302017334</LEG320-A-DB2-DATE>
				<LEG320-A-DB2-TIME>16223500</LEG320-A-DB2-TIME>
				<LEG320-I-CUST-HOLD-CO>1</LEG320-I-CUST-HOLD-CO>
				<LEG320-I-CUST-BANK-NO>1</LEG320-I-CUST-BANK-NO>
				<LEG320-I-CUST-APPL>CUST</LEG320-I-CUST-APPL>
				<LEG320-I-CUST-NO>
					<LEG320-I-CUST-NO-11>00001396181</LEG320-I-CUST-NO-11>
					<LEG320-I-CUST-NO-F1>
					</LEG320-I-CUST-NO-F1>
				</LEG320-I-CUST-NO>
				<LEG320-I-CUST-REQ>I</LEG320-I-CUST-REQ>
				<LEG320-I-CUST-IND>Y</LEG320-I-CUST-IND>
				<LEG320-I-ADDR-IND>Y</LEG320-I-ADDR-IND>
				<LEG320-I-CSLG-IND>Y</LEG320-I-CSLG-IND>
				<LEG320-I-ADLG-IND>Y</LEG320-I-ADLG-IND>
				<LEG320-I-ADDR-OVERRIDE>Y</LEG320-I-ADDR-OVERRIDE>
				<LEG320-CNAM-EFF-DATE>0</LEG320-CNAM-EFF-DATE>
				<LEG320-CNAM-PROCESS-TIME>0</LEG320-CNAM-PROCESS-TIME>
				<LEG320-CNAM-CUST-TYPE>I</LEG320-CNAM-CUST-TYPE>
				<LEG320-CNAM-NAME-LINE>JEREMY J MARRERO-RODRIGUEZ
				</LEG320-CNAM-NAME-LINE>
				<LEG320-CNAM-PRIM-PHONE>7876330675</LEG320-CNAM-PRIM-PHONE>
				<LEG320-CNAM-SEC-PHONE>0</LEG320-CNAM-SEC-PHONE>
				<LEG320-CNAM-TELEX-PHONE>0</LEG320-CNAM-TELEX-PHONE>
				<LEG320-CNAM-FAX-PHONE>0</LEG320-CNAM-FAX-PHONE>
				<LEG320-ADDR-ADDR-DATA>
					<item>
						<LEG320-ADDR-LINE-TYPE>S</LEG320-ADDR-LINE-TYPE>
						<LEG320-ADDR-LINE>5342</LEG320-ADDR-LINE>
					</item>
					<item>
						<LEG320-ADDR-LINE-TYPE>C</LEG320-ADDR-LINE-TYPE>
						<LEG320-ADDR-LINE>ARECIBO PR 00612</LEG320-ADDR-LINE>
					</item>
					<item>
						<LEG320-ADDR-LINE-TYPE></LEG320-ADDR-LINE-TYPE>
						<LEG320-ADDR-LINE></LEG320-ADDR-LINE>
					</item>
					<item>
						<LEG320-ADDR-LINE-TYPE></LEG320-ADDR-LINE-TYPE>
						<LEG320-ADDR-LINE></LEG320-ADDR-LINE>
					</item>
					<item>
						<LEG320-ADDR-LINE-TYPE></LEG320-ADDR-LINE-TYPE>
						<LEG320-ADDR-LINE></LEG320-ADDR-LINE>
					</item>
				</LEG320-ADDR-ADDR-DATA>
				<LEG320-CUST-CUST-REC-TYP>
				</LEG320-CUST-CUST-REC-TYP>
				<LEG320-CUST-CUST-STATUS>O</LEG320-CUST-CUST-STATUS>
				<LEG320-CUST-TAX-CODE>S</LEG320-CUST-TAX-CODE>
				<LEG320-CUST-TAX-NO>584958596</LEG320-CUST-TAX-NO>
				<LEG320-CUST-LST-MNT-DATE>0</LEG320-CUST-LST-MNT-DATE>
				<LEG320-CUST-LST-MNT-OPER>
				</LEG320-CUST-LST-MNT-OPER>
				<LEG320-CUST-PRIM-OFF>82153</LEG320-CUST-PRIM-OFF>
				<LEG320-CUST-SEC-OFF>0</LEG320-CUST-SEC-OFF>
				<LEG320-CUST-CYC-CODE>0</LEG320-CUST-CYC-CODE>
				<LEG320-CUST-MAIL-CODE>9</LEG320-CUST-MAIL-CODE>
				<LEG320-CUST-CR-RATING>E</LEG320-CUST-CR-RATING>
				<LEG320-CUST-ETHNIC>
				</LEG320-CUST-ETHNIC>
				<LEG320-CUST-CITIZENSHIP>
				</LEG320-CUST-CITIZENSHIP>
				<LEG320-CUST-CUST-SINCE>0</LEG320-CUST-CUST-SINCE>
				<LEG320-CUST-CUST-OPEN>0</LEG320-CUST-CUST-OPEN>
				<LEG320-CUST-CUST-CLOSED>0</LEG320-CUST-CUST-CLOSED>
				<LEG320-CUST-CUST-CODE-1>000</LEG320-CUST-CUST-CODE-1>
				<LEG320-CUST-CUST-CODE-2>000</LEG320-CUST-CUST-CODE-2>
				<LEG320-CUST-CUST-CODE-3>000</LEG320-CUST-CUST-CODE-3>
				<LEG320-CUST-CUST-CODE-4>000</LEG320-CUST-CUST-CODE-4>
				<LEG320-CUST-CUST-CODE-5>000</LEG320-CUST-CUST-CODE-5>
				<LEG320-CUST-CUST-CODE-6>000</LEG320-CUST-CUST-CODE-6>
				<LEG320-CUST-CUST-CODE-7>000</LEG320-CUST-CUST-CODE-7>
				<LEG320-CUST-CUST-CODE-8>000</LEG320-CUST-CUST-CODE-8>
				<LEG320-CUST-CUST-CODE-9>000</LEG320-CUST-CUST-CODE-9>
				<LEG320-CUST-CUST-CODE-10>000</LEG320-CUST-CUST-CODE-10>
				<LEG320-CUST-CUST-CODE-11>000</LEG320-CUST-CUST-CODE-11>
				<LEG320-CUST-CUST-CODE-12>000</LEG320-CUST-CUST-CODE-12>
				<LEG320-CUST-CUST-CODE-13>000</LEG320-CUST-CUST-CODE-13>
				<LEG320-CUST-CUST-CODE-14>000</LEG320-CUST-CUST-CODE-14>
				<LEG320-CUST-CUST-CODE-15>000</LEG320-CUST-CUST-CODE-15>
				<LEG320-CUST-CUST-CODE-16>000</LEG320-CUST-CUST-CODE-16>
				<LEG320-CUST-CUST-CODE-17>000</LEG320-CUST-CUST-CODE-17>
				<LEG320-CUST-CUST-CODE-18>000</LEG320-CUST-CUST-CODE-18>
				<LEG320-CUST-CUST-CODE-19>000</LEG320-CUST-CUST-CODE-19>
				<LEG320-CUST-CUST-CODE-20>000</LEG320-CUST-CUST-CODE-20>
				<LEG320-CUST-MISC-DEMO-5>
				</LEG320-CUST-MISC-DEMO-5>
				<LEG320-CUST-MISC-DEMO-7>null</LEG320-CUST-MISC-DEMO-7>
				<LEG320-CUST-MISC-DEMO-9>null</LEG320-CUST-MISC-DEMO-9>
				<LEG320-CUST-MISC-DEMO-10>
				</LEG320-CUST-MISC-DEMO-10>
				<LEG320-CUST-WTHOLD-IND>
				</LEG320-CUST-WTHOLD-IND>
				<LEG320-CUST-AFFILIATE-1>
				</LEG320-CUST-AFFILIATE-1>
				<LEG320-CUST-MISC-DEMO-18>
				</LEG320-CUST-MISC-DEMO-18>
				<LEG320-CUST-MISC-DEMO-19>
				</LEG320-CUST-MISC-DEMO-19>
				<LEG320-CUST-MISC-DEMO-20>
				</LEG320-CUST-MISC-DEMO-20>
				<LEG320-CUST-TELEBANCO-CLUE>
				</LEG320-CUST-TELEBANCO-CLUE>
				<LEG320-CUST-CLUE-LST-MNT-DATE>0</LEG320-CUST-CLUE-LST-MNT-DATE>
				<LEG320-CUST-CLUE-LST-MNT-OPER>
				</LEG320-CUST-CLUE-LST-MNT-OPER>
				<LEG320-CUST-PASSPORT-NBR>0</LEG320-CUST-PASSPORT-NBR>
				<LEG320-CUST-PASSPORT-CNTRY>
				</LEG320-CUST-PASSPORT-CNTRY>
				<LEG320-CUST-ALIEN-ID-NBR>
				</LEG320-CUST-ALIEN-ID-NBR>
				<LEG320-CUST-ALIEN-ID-CNTRY>
				</LEG320-CUST-ALIEN-ID-CNTRY>
				<LEG320-CUST-NAICS-CODE>0</LEG320-CUST-NAICS-CODE>
				<LEG320-CUST-SEND-EMAIL>N</LEG320-CUST-SEND-EMAIL>
				<LEG320-CUST-EMAIL-1>MARREROJJ@HOTMAIL.COM</LEG320-CUST-EMAIL-1>
				<LEG320-CIDM-INCOME>
				</LEG320-CIDM-INCOME>
				<LEG320-CIDM-EDUCATION>
				</LEG320-CIDM-EDUCATION>
				<LEG320-CIDM-OCCUPATION>
				</LEG320-CIDM-OCCUPATION>
				<LEG320-CIDM-MARITAL-STAT>
				</LEG320-CIDM-MARITAL-STAT>
				<LEG320-CIDM-OWN-RENT>
				</LEG320-CIDM-OWN-RENT>
				<LEG320-CIDM-MTHS-MAIDEN>
				</LEG320-CIDM-MTHS-MAIDEN>
				<LEG320-CIDM-EMPL-SCHOOL>
				</LEG320-CIDM-EMPL-SCHOOL>
				<LEG320-CIDM-EMPL-DATE>0</LEG320-CIDM-EMPL-DATE>
				<LEG320-CIDM-BIRTH-DATE>02211983052</LEG320-CIDM-BIRTH-DATE>
				<LEG320-CIDM-DEATH-DATE>0</LEG320-CIDM-DEATH-DATE>
				<LEG320-CODM-SIC-CODE>0</LEG320-CODM-SIC-CODE>
				<LEG320-CODM-D-B-CODE>0</LEG320-CODM-D-B-CODE>
				<LEG320-CODM-SALES>
				</LEG320-CODM-SALES>
				<LEG320-CODM-NET-WORTH>
				</LEG320-CODM-NET-WORTH>
				<LEG320-CODM-BUS-TYPE>
				</LEG320-CODM-BUS-TYPE>
				<LEG320-CODM-BUS-SINCE>0</LEG320-CODM-BUS-SINCE>
				<LEG320-CNAM-LAST-CHANGE>0</LEG320-CNAM-LAST-CHANGE>
				<LEG320-CUST-LAST-MNT-TIME>0</LEG320-CUST-LAST-MNT-TIME>
				<LEG320-CUST-PROCESS-TIME>0</LEG320-CUST-PROCESS-TIME>
				<LEG320-CUST-PREV-MNT-DATE>0</LEG320-CUST-PREV-MNT-DATE>
				<LEG320-ADDR-REF-NO>0</LEG320-ADDR-REF-NO>
				<LEG320-ADDR-PROCESS-TIME>0</LEG320-ADDR-PROCESS-TIME>
				<LEG320-ADDR-LAST-CHANGE>0</LEG320-ADDR-LAST-CHANGE>
				<LEG320-CAMPAIGN-CODE-1>VT CB LA  </LEG320-CAMPAIGN-CODE-1>
				<LEG320-CAMPAIGN-CODE-2>PA OF IG DE SI  </LEG320-CAMPAIGN-CODE-2>
				<LEG320-CUST-EMAIL-2>
				</LEG320-CUST-EMAIL-2>
				<LEG320-CAMPAIGN-CODE-3>
				</LEG320-CAMPAIGN-CODE-3>
				<LEG320-DCI-REMOVE-CD-DTE>
				</LEG320-DCI-REMOVE-CD-DTE>
			</LEG320-COMM-REC>
		</CISCUSTA>
	</soapenv:Body>
</soapenv:Envelope>